WSDL/Producao/PImperatrizMA-RecepcaoNFSe.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3-hudson-390-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3-hudson-390-. --><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://wsnfselote.ctaconsult.com.br/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="RecepcaoNFSeService" targetNamespace="http://wsnfselote.ctaconsult.com.br/">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://wsnfselote.ctaconsult.com.br/" schemaLocation="http://stm.imperatriz.d2ti.com.br:80/wsnfselote/RecepcaoNFSePort?xsd=1" />
    </xsd:schema>
  </types>
  <message name="executar">
    <part element="tns:executar" name="parameters" />
  </message>
  <message name="executarResponse">
    <part element="tns:executarResponse" name="parameters" />
  </message>
  <portType name="RecepcaoNFSeDelegate">
    <operation name="executar">
      <input message="tns:executar" />
      <output message="tns:executarResponse" />
    </operation>
  </portType>
  <binding name="RecepcaoNFSePortBinding" type="tns:RecepcaoNFSeDelegate">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" />
    <operation name="executar">
      <soap:operation soapAction="" />
      <input>
        <soap:body use="literal" />
      </input>
      <output>
        <soap:body use="literal" />
      </output>
    </operation>
  </binding>
  <service name="RecepcaoNFSeService">
    <port binding="tns:RecepcaoNFSePortBinding" name="RecepcaoNFSePort">
      <soap:address location="http://stm.imperatriz.d2ti.com.br:80/wsnfselote/RecepcaoNFSePort" />
    </port>
  </service>
</definitions>